app/controllers/users_controller.rb

  def create
    #logout_keeping_session!
    @user = User.new(params[:user])
    @user.role = current_user ? "admin" : "user"
    success = @user && @user.save
---
INSERT INTO `users` (`name`, `salt`, `created_at`, `activated_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `activation_code`, `role`, `remember_token`, `email`) VALUES('Federico Gonzalez Lutteroth', '7117f3d36f3eabf8f1f8eb030d8d77419be8c198', '2009-11-11 01:13:10', NULL, '76a0d23b1ae512d81410bd22118bfe5475ce1809', NULL, '2009-11-11 01:13:10', 'fbafb6297e2770fca09841892d33da48152535e9', NULL, NULL, 'federico@innku.com')

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
UPDATE `users` SET `updated_at` = '2009-11-11 16:34:27', `name` = 'Federico Gonzalez L' WHERE `id` = 1

  def activate
    logout_keeping_session!
    user = User.find_by_activation_code(params[:activation_code]) unless params[:activation_code].blank?
---
SELECT * FROM `users` WHERE (`users`.`activation_code` = 'fbafb6297e2770fca09841892d33da48152535e9') LIMIT 1